--
-- PostgreSQL database dump
--

\restrict AiLlt58eiuLsZpPCM5moMglcrPuW6JHpq9CgJZMaaLucjEhjXm82zfqCL7Jix08

-- Dumped from database version 18.6
-- Dumped by pg_dump version 18.6

-- Started on 2026-10-27 21:30:09

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- TOC entry 222 (class 1259 OID 16754)
-- Name: products; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.products (
    id integer NOT NULL,
    category character varying(50),
    subcategory character varying(50),
    image character varying(100),
    name character varying(200) NOT NULL,
    production character varying(100),
    description text,
    composition text,
    price numeric(10,2),
    stock integer DEFAULT 0,
    discount_percent integer DEFAULT 0,
    CONSTRAINT products_price_check CHECK ((price > (0)::numeric))
);


ALTER TABLE public.products OWNER TO postgres;

--
-- TOC entry 221 (class 1259 OID 16753)
-- Name: products_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.products_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.products_id_seq OWNER TO postgres;

--
-- TOC entry 4983 (class 0 OID 0)
-- Dependencies: 221
-- Name: products_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.products_id_seq OWNED BY public.products.id;


--
-- TOC entry 220 (class 1259 OID 16592)
-- Name: users; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.users (
    id integer NOT NULL,
    login character varying(50) NOT NULL,
    role character varying(20) DEFAULT 'user'::character varying,
    created_at date DEFAULT CURRENT_DATE,
    last_name character varying(50),
    first_name character varying(50),
    middle_name character varying(50)
);


ALTER TABLE public.users OWNER TO postgres;

--
-- TOC entry 219 (class 1259 OID 16591)
-- Name: users_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.users_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.users_id_seq OWNER TO postgres;

--
-- TOC entry 4984 (class 0 OID 0)
-- Dependencies: 219
-- Name: users_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.users_id_seq OWNED BY public.users.id;


--
-- TOC entry 4817 (class 2604 OID 16757)
-- Name: products id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.products ALTER COLUMN id SET DEFAULT nextval('public.products_id_seq'::regclass);


--
-- TOC entry 4814 (class 2604 OID 16595)
-- Name: users id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.users ALTER COLUMN id SET DEFAULT nextval('public.users_id_seq'::regclass);


--
-- TOC entry 4977 (class 0 OID 16754)
-- Dependencies: 222
-- Data for Name: products; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.products (id, category, subcategory, image, name, production, description, composition, price, stock, discount_percent) FROM stdin;
25	Подвески	Серебро	IMG_11_025.png	Подвеска Луна	Грань	Подвеска Луна. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	1990.00	48	0
26	Подвески	Серебро	IMG_11_026.png	Подвеска Солнце	ЮвелирЛайн	Подвеска Солнце. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	2290.00	57	0
27	Подвески	Серебро	IMG_11_027.png	Подвеска Лист	Серебряная нить	Подвеска Лист. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	2590.00	42	0
28	Подвески	Серебро	IMG_11_028.png	Подвеска Сердце	Карат	Подвеска Сердце. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	2890.00	4	0
56	Подвески	Серебро	IMG_11_025.png	Подвеска Луна	Грань	Подвеска Луна. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	1990.00	48	0
57	Подвески	Серебро	IMG_11_026.png	Подвеска Солнце	ЮвелирЛайн	Подвеска Солнце. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	2290.00	57	0
58	Подвески	Серебро	IMG_11_027.png	Подвеска Лист	Серебряная нить	Подвеска Лист. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	2590.00	42	0
7	Кольца	Серебро	IMG_11_007.png	Кольцо Орбита	Серебряная нить	Кольцо Орбита. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	5390.00	54	15
8	Кольца	Серебро	IMG_11_008.png	Кольцо Классик	Карат	Кольцо Классик. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	5790.00	63	15
36	Кольца	Серебро	IMG_11_005.png	Кольцо Лист	Грань	Кольцо Лист. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	4590.00	36	15
37	Кольца	Серебро	IMG_11_006.png	Кольцо Звезда	ЮвелирЛайн	Кольцо Звезда. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	4990.00	45	15
38	Кольца	Серебро	IMG_11_007.png	Кольцо Орбита	Серебряная нить	Кольцо Орбита. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	5390.00	54	15
3	Кольца	Серебро	IMG_11_003.png	Кольцо Круг	Серебряная нить	Кольцо Круг. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	3790.00	42	15
4	Кольца	Серебро	IMG_11_004.png	Кольцо Грань	Карат	Кольцо Грань. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	4190.00	51	15
32	Кольца	Серебро	IMG_11_001.png	Кольцо Линия	Грань	Кольцо Линия. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	2990.00	48	15
29	Подвески	Серебро	IMG_11_029.png	Подвеска Круг	Грань	Подвеска Круг. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	3190.00	3	0
30	Подвески	Серебро	IMG_11_030.png	Подвеска Геометрия	ЮвелирЛайн	Подвеска Геометрия. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	3490.00	2	0
31	Подвески	Серебро	\N	Подвеска Звезда	Серебряная нить	Подвеска Звезда. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	3790.00	0	0
59	Подвески	Серебро	IMG_11_028.png	Подвеска Сердце	Карат	Подвеска Сердце. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	2890.00	4	0
60	Подвески	Серебро	IMG_11_029.png	Подвеска Круг	Грань	Подвеска Круг. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	3190.00	3	0
61	Подвески	Серебро	IMG_11_030.png	Подвеска Геометрия	ЮвелирЛайн	Подвеска Геометрия. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	3490.00	2	0
62	Подвески	Серебро	\N	Подвеска Звезда	Серебряная нить	Подвеска Звезда. Категория: Подвески. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Диаметр 15 мм, Диаметр 20 мм, Диаметр 25 мм.	Серебро 925; без драгоценных вставок	3790.00	0	0
63	Часы	\N	\N	Тестовые часы	\N	\N	\N	1000.00	0	0
33	Кольца	Серебро	IMG_11_002.png	Кольцо Волна	ЮвелирЛайн	Кольцо Волна. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	3390.00	57	15
34	Кольца	Серебро	IMG_11_003.png	Кольцо Круг	Серебряная нить	Кольцо Круг. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	3790.00	42	15
35	Кольца	Серебро	IMG_11_004.png	Кольцо Грань	Карат	Кольцо Грань. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	4190.00	51	15
5	Кольца	Серебро	IMG_11_005.png	Кольцо Лист	Грань	Кольцо Лист. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	4590.00	36	15
6	Кольца	Серебро	IMG_11_006.png	Кольцо Звезда	ЮвелирЛайн	Кольцо Звезда. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	4990.00	45	15
39	Кольца	Серебро	IMG_11_008.png	Кольцо Классик	Карат	Кольцо Классик. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	5790.00	63	15
1	Кольца	Серебро	IMG_11_001.png	Кольцо Линия	Грань	Кольцо Линия. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	2990.00	48	15
2	Кольца	Серебро	IMG_11_002.png	Кольцо Волна	ЮвелирЛайн	Кольцо Волна. Категория: Кольца. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Размер 16, Размер 17, Размер 18.	Серебро 925; декоративная вставка из фианита	3390.00	57	15
9	Браслеты	Серебро	IMG_11_009.png	Браслет Цепь	Грань	Браслет Цепь. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	3990.00	48	10
10	Браслеты	Серебро	IMG_11_010.png	Браслет Нить	ЮвелирЛайн	Браслет Нить. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	4490.00	57	10
11	Браслеты	Серебро	IMG_11_011.png	Браслет Ритм	Серебряная нить	Браслет Ритм. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	4990.00	42	10
12	Браслеты	Серебро	IMG_11_012.png	Браслет Вектор	Карат	Браслет Вектор. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	5490.00	51	10
13	Браслеты	Серебро	IMG_11_013.png	Браслет Контур	Грань	Браслет Контур. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	5990.00	36	10
14	Браслеты	Серебро	IMG_11_014.png	Браслет Ветвь	ЮвелирЛайн	Браслет Ветвь. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	6490.00	45	10
15	Браслеты	Серебро	IMG_11_015.png	Браслет Луч	Серебряная нить	Браслет Луч. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	6990.00	54	10
16	Браслеты	Серебро	IMG_11_016.png	Браслет Баланс	Карат	Браслет Баланс. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	7490.00	63	10
40	Браслеты	Серебро	IMG_11_009.png	Браслет Цепь	Грань	Браслет Цепь. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	3990.00	48	10
41	Браслеты	Серебро	IMG_11_010.png	Браслет Нить	ЮвелирЛайн	Браслет Нить. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	4490.00	57	10
42	Браслеты	Серебро	IMG_11_011.png	Браслет Ритм	Серебряная нить	Браслет Ритм. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	4990.00	42	10
43	Браслеты	Серебро	IMG_11_012.png	Браслет Вектор	Карат	Браслет Вектор. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	5490.00	51	10
44	Браслеты	Серебро	IMG_11_013.png	Браслет Контур	Грань	Браслет Контур. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	5990.00	36	10
45	Браслеты	Серебро	IMG_11_014.png	Браслет Ветвь	ЮвелирЛайн	Браслет Ветвь. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	6490.00	45	10
46	Браслеты	Серебро	IMG_11_015.png	Браслет Луч	Серебряная нить	Браслет Луч. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	6990.00	54	10
47	Браслеты	Серебро	IMG_11_016.png	Браслет Баланс	Карат	Браслет Баланс. Категория: Браслеты. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 16 см, Длина 18 см, Длина 20 см.	Серебро 925; застёжка карабин	7490.00	63	10
18	Цепочки	Серебро	IMG_11_018.png	Цепочка Панцирная	ЮвелирЛайн	Цепочка Панцирная. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	5040.00	57	20
19	Цепочки	Серебро	IMG_11_019.png	Цепочка Ромб	Серебряная нить	Цепочка Ромб. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	5590.00	42	20
20	Цепочки	Серебро	IMG_11_020.png	Цепочка Снейк	Карат	Цепочка Снейк. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	6140.00	51	20
21	Цепочки	Серебро	IMG_11_021.png	Цепочка Тонкая	Грань	Цепочка Тонкая. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	6690.00	36	20
49	Цепочки	Серебро	IMG_11_018.png	Цепочка Панцирная	ЮвелирЛайн	Цепочка Панцирная. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	5040.00	57	20
50	Цепочки	Серебро	IMG_11_019.png	Цепочка Ромб	Серебряная нить	Цепочка Ромб. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	5590.00	42	20
22	Цепочки	Серебро	IMG_11_022.png	Цепочка Классик	ЮвелирЛайн	Цепочка Классик. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	7240.00	45	20
23	Цепочки	Серебро	IMG_11_023.png	Цепочка Лента	Серебряная нить	Цепочка Лента. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	7790.00	54	20
48	Цепочки	Серебро	IMG_11_017.png	Цепочка Якорная	Грань	Цепочка Якорная. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	4490.00	48	20
51	Цепочки	Серебро	IMG_11_020.png	Цепочка Снейк	Карат	Цепочка Снейк. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	6140.00	51	20
52	Цепочки	Серебро	IMG_11_021.png	Цепочка Тонкая	Грань	Цепочка Тонкая. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	6690.00	36	20
53	Цепочки	Серебро	IMG_11_022.png	Цепочка Классик	ЮвелирЛайн	Цепочка Классик. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	7240.00	45	20
54	Цепочки	Серебро	IMG_11_023.png	Цепочка Лента	Серебряная нить	Цепочка Лента. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	7790.00	54	20
17	Цепочки	Серебро	IMG_11_017.png	Цепочка Якорная	Грань	Цепочка Якорная. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	4490.00	48	20
24	Цепочки	Серебро	IMG_11_024.png	Цепочка Плетение	Карат	Цепочка Плетение. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	8340.00	63	20
55	Цепочки	Серебро	IMG_11_024.png	Цепочка Плетение	Карат	Цепочка Плетение. Категория: Цепочки. Тип: Серебро. Единица заказа: шт.. Доступные варианты: Длина 40 см, Длина 45 см, Длина 50 см.	Серебро 925; ювелирный замок	8340.00	63	20
\.


--
-- TOC entry 4975 (class 0 OID 16592)
-- Dependencies: 220
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.users (id, login, role, created_at, last_name, first_name, middle_name) FROM stdin;
3	client	Клиент	2026-10-24	Иванов	Иван	Иванович
2	manager	Менеджер	2026-10-24	Петров	Петр	Петрович
1	admin	Администратор	2026-10-24	Иванов	Иван	Сергеевич
6	manager1	Менеджер	2026-10-24	Петров	Пётр	Алексеевич
7	manager2	Менеджер	2026-10-24	Смирнова	Ольга	Викторовна
8	client01	Клиент	2026-10-24	Сидоров	Алексей	Иванович
9	client02	Клиент	2026-10-24	Кузнецова	Анна	Ивановна
10	client03	Клиент	2026-10-24	Орлов	Алексей	Иванович
11	client04	Клиент	2026-10-24	Новикова	Анна	Ивановна
12	client05	Клиент	2026-10-24	Морозов	Алексей	Иванович
13	client06	Клиент	2026-10-24	Волкова	Анна	Ивановна
14	client07	Клиент	2026-10-24	Соколов	Алексей	Иванович
15	client08	Клиент	2026-10-24	Лебедева	Анна	Ивановна
16	client09	Клиент	2026-10-24	Попов	Алексей	Иванович
17	client10	Клиент	2026-10-24	Егорова	Анна	Ивановна
18	client11	Клиент	2026-10-24	Зайцев	Алексей	Иванович
19	client12	Клиент	2026-10-24	Павлова	Анна	Ивановна
20	client13	Клиент	2026-10-24	Семёнов	Алексей	Иванович
21	client14	Клиент	2026-10-24	Фёдорова	Анна	Ивановна
22	client15	Клиент	2026-10-24	Козлов	Алексей	Иванович
23	client16	Клиент	2026-10-24	Макарова	Анна	Ивановна
24	client17	Клиент	2026-10-24	Белов	Алексей	Иванович
\.


--
-- TOC entry 4985 (class 0 OID 0)
-- Dependencies: 221
-- Name: products_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.products_id_seq', 63, true);


--
-- TOC entry 4986 (class 0 OID 0)
-- Dependencies: 219
-- Name: users_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.users_id_seq', 24, true);


--
-- TOC entry 4826 (class 2606 OID 16764)
-- Name: products products_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.products
    ADD CONSTRAINT products_pkey PRIMARY KEY (id);


--
-- TOC entry 4822 (class 2606 OID 16603)
-- Name: users users_login_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_login_key UNIQUE (login);


--
-- TOC entry 4824 (class 2606 OID 16601)
-- Name: users users_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_pkey PRIMARY KEY (id);


-- Completed on 2026-10-27 21:30:09

--
-- PostgreSQL database dump complete
--

\unrestrict AiLlt58eiuLsZpPCM5moMglcrPuW6JHpq9CgJZMaaLucjEhjXm82zfqCL7Jix08

